<a href="https://colab.research.google.com/github/fedhere/DSPS_FBianco/blob/main/Labs/earthquake_data_munging.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
earthquakes = pd.read_csv("https://raw.githubusercontent.com/fedhere/DSPS_FBianco/refs/heads/main/data/earthquakes.csv",
            sep=r"\s+")

In [3]:
earthquakes.shape

(70798, 13)

In [4]:
earthquakes.head()

,#YYY/MM/DD,HH:mm:SS.ss,ET,GT,MAG,M,LAT,LON,DEPTH,Q,EVID,NPH,NGRM
0,1984/01/01,01:30:57.52,eq,l,2.02,c,33.246,-116.433,1.6,C,28255,13,17
1,1984/01/01,05:31:34.16,eq,l,2.12,c,32.945,-116.295,5.4,C,28259,18,42
2,1984/01/01,06:59:05.14,eq,l,2.43,c,33.343,-117.628,5.6,C,28260,13,30
3,1984/01/01,11:10:25.29,eq,l,2.07,c,33.668,-116.780,13.8,C,28270,19,40
4,1984/01/01,19:38:19.79,eq,l,2.13,c,33.963,-116.290,2.7,C,28553,40,49

In [5]:
earthquakes.tail()

,#YYY/MM/DD,HH:mm:SS.ss,ET,GT,MAG,M,LAT,LON,DEPTH,Q,EVID,NPH,NGRM
70793,2002/12/29,19:37:24.56,eq,l,2.21,l,35.31400,-118.66767,3.7,A,9874709,25,948
70794,2002/12/29,20:17:33.40,eq,l,2.02,l,35.32133,-118.66000,1.8,A,9874745,48,245
70795,2002/12/29,20:21:28.73,eq,l,2.07,l,35.32150,-118.66617,1.9,A,9874749,53,277
70796,2002/12/30,21:51:52.55,eq,l,2.31,l,35.31867,-118.66250,1.5,A,9875017,66,404
70797,2002/12/30,23:38:49.79,eq,l,2.05,l,35.31450,-118.66333,1.9,A,9875061,54,283

In [6]:
earthquakes.MAG

0        2.02
1        2.12
2        2.43
3        2.07
4        2.13
         ...
70793    2.21
70794    2.02
70795    2.07
70796    2.31
70797    2.05
Name: MAG, Length: 70798, dtype: float64

In [7]:
earthquakes.columns

Index(['#YYY/MM/DD', 'HH:mm:SS.ss', 'ET', 'GT', 'MAG', 'M', 'LAT', 'LON',
       'DEPTH', 'Q', 'EVID', 'NPH', 'NGRM'],
      dtype='object')

In [8]:
earthquakes = earthquakes[['#YYY/MM/DD', 'HH:mm:SS.ss', "MAG"]]

In [9]:
earthquakes.dtypes

#YYY/MM/DD      object
HH:mm:SS.ss     object
MAG            float64
dtype: object

In [10]:
earthquakes.rename({"#YYY/MM/DD": "date", "HH:mm:SS.ss": "time", "MAG":"mag" },
                   axis=1, inplace=True)

In [11]:
earthquakes

             date         time   mag
0      1984/01/01  01:30:57.52  2.02
1      1984/01/01  05:31:34.16  2.12
2      1984/01/01  06:59:05.14  2.43
3      1984/01/01  11:10:25.29  2.07
4      1984/01/01  19:38:19.79  2.13
...           ...          ...   ...
70793  2002/12/29  19:37:24.56  2.21
70794  2002/12/29  20:17:33.40  2.02
70795  2002/12/29  20:21:28.73  2.07
70796  2002/12/30  21:51:52.55  2.31
70797  2002/12/30  23:38:49.79  2.05

[70798 rows x 3 columns]

In [12]:
earthquakes.rename({"#YYY/MM/DD": "date", "HH:mm:SS.ss": "time", "MAG":"mag" },
                   axis=1)

             date         time   mag
0      1984/01/01  01:30:57.52  2.02
1      1984/01/01  05:31:34.16  2.12
2      1984/01/01  06:59:05.14  2.43
3      1984/01/01  11:10:25.29  2.07
4      1984/01/01  19:38:19.79  2.13
...           ...          ...   ...
70793  2002/12/29  19:37:24.56  2.21
70794  2002/12/29  20:17:33.40  2.02
70795  2002/12/29  20:21:28.73  2.07
70796  2002/12/30  21:51:52.55  2.31
70797  2002/12/30  23:38:49.79  2.05

[70798 rows x 3 columns]

In [13]:
earthquakes.describe()

                mag
count  70798.000000
mean       2.417826
std        0.407683
min        2.000000
25%        2.120000
50%        2.300000
75%        2.590000
max        7.100000

In [14]:
pd.to_datetime("2002/12/29" + " " + "01:30:57.52")

Timestamp('2002-12-29 01:30:57.520000')

In [15]:
earthquakes["newdate"] = earthquakes["date"].map(pd.to_datetime)

In [16]:
earthquakes['datetime'] = earthquakes['date'] + ' ' + earthquakes['time']

In [17]:
for i in earthquakes.index:
    if earthquakes.loc[i, 'time'].endswith('60.00') :
        print(earthquakes.loc[i, 'time'][:6] + '59.99'
        # earthquakes.loc[i, 'time'] = earthquakes.loc[i, 'time'][:6] + '59.99'

        
earthquakes['newdatetime'] = earthquakes['datetime'].map(pd.to_datetime)

SyntaxError: '(' was never closed (3105505519.py, line 3)